app/Controllers/CiudadController.php

    public function getCiudades(){
        $model = model('CiudadModel');
        $data['ciudades'] = $model->findAll();
---
SELECT *
FROM `Ciudad`
WHERE `Ciudad`.`deleted_at` IS NULL

    public function postCiudad(){
        $model = model('CiudadModel');
        $request = request();
        $ciudad = $_POST['ciudad'];
        $abreviatura = $_POST['abreviatura'];
        $data = [
            'ciudad'=>$ciudad,
            'abreviatura' => $abreviatura
        ];
        $model->insert($data, false);
---
INSERT INTO `Ciudad` (`ciudad`, `abreviatura`, `created_at`, `updated_at`) VALUES ('Hueytamalco', 'Huey', '2024-02-16 21:29:45', '2024-02-16 21:29:45')