app/Controllers/ClimaController.php

    public function getClima(){
        $climaModel = model('ClimaModel');
        $data['clima'] = $climaModel->findAll();
---
SELECT *
FROM `Clima`